<?
/* ============================================================================== */
/* =   PAGE : 인증 요청 및 결과 처리 PAGE										= */
/* = -------------------------------------------------------------------------- = */
/* =   연동시 오류가 발생하는 경우 아래의 주소로 접속하셔서 확인하시기 바랍니다.= */
/* =   접속 주소 : http://testpay.kcp.co.kr/pgsample/FAQ/search_error.jsp       = */
/* = -------------------------------------------------------------------------- = */
/* =   Copyright (c)  2010.03   KCP Inc.   All Rights Reserved.                 = */
/* ============================================================================== */
/* ============================================================================== */
/* =   환경 설정 파일 Include                                                   = */
/* = -------------------------------------------------------------------------- = */
/* =   ※ 필수                                                                  = */
/* =   테스트 및 실결제 연동시 site_conf_inc.jsp파일을 수정하시기 바랍니다.     = */
/* = -------------------------------------------------------------------------- = */
/* ============================================================================== */
/* = 라이브러리 및 사이트 정보 include                                          = */
/* = -------------------------------------------------------------------------- = */

setlocale(LC_CTYPE, 'ko_KR.euc-kr');

$Dir = "../../../";
include_once($_SERVER['DOCUMENT_ROOT']."/lib/init.php");
include_once(DOC_ROOT."/lib/lib.php");

include(DOC_ROOT.'/../_pg/NHNKCP/cfg/conf.php'); //환경설정 파일 include
require "hub_account_lib.php";			  // library [수정불가]

/* ============================================================================== */
/* = -------------------------------------------------------------------------- = */
/* =   환경 설정 파일 Include END                                               = */
/* ============================================================================== */

?>

<?
//print_r(iconv("UTF-8","EUC-KR",$_POST['owner_nm']));exit;
/* ============================================================================== */
/* =   01. 인증 요청 정보 설정													= */
/* = -------------------------------------------------------------------------- = */
$pay_method   = $_POST[ "pay_method"     ]; // 인증 방법
$ordr_idxx    = $_POST[ "ordr_idxx"      ]; // 주문 번호
$req_tx       = $_POST[ "req_tx"         ]; // 요청 종류
/* = -------------------------------------------------------------------------- = */
$cust_ip	  = getenv( "REMOTE_ADDR" );    // 요청 IP
$tran_cd      = "";                         // 트랜잭션 코드
$res_cd       = "";                         // 응답코드
$res_msg      = "";                         // 응답메시지
$tno          = "";                         // 거래번호
/* = -------------------------------------------------------------------------- = */
$owner_nm     = iconv("UTF-8", "EUC-KR", $_POST["owner_nm"]); // 계좌주명

$bank_code    = $_POST[ "bank_code"      ]; // 은행코드
$bank_name    = "";							// 은행명
$account_no   = $_POST[ "account_no"     ]; // 계좌번호
$app_time     = "";
//print_r($owner_nm);
/* = -------------------------------------------------------------------------- = */
/* =   01. 인증 요청 정보 설정 END                                              = */
/* ============================================================================== */
/* ============================================================================== */
/* =   02. 인스턴스 생성 및 초기화(변경 불가)                                   = */
/* = -------------------------------------------------------------------------- = */
/* =   결제에 필요한 인스턴스를 생성하고 초기화 합니다.                         = */
/* =   ※ 주의 ※ 이 부분은 변경하지 마십시오                                   = */
/* = -------------------------------------------------------------------------- = */
$c_PayPlus  = new C_PAYPLUS_CLI;
$c_PayPlus->mf_clear();
/* = -------------------------------------------------------------------------- = */
/* =   02. 인스턴스 생성 및 초기화 END                                          = */
/* ============================================================================== */
/* ============================================================================== */
/* =   03. 인증 요청 정보 설정                                                  = */
/* = -------------------------------------------------------------------------- = */
//print_r($_POST);
if ( $req_tx == "pay" )
{
    $tran_cd = "00100000";
    $payx_data_set = "";
    $common_data_set = "";
    $common_data_set .= $c_PayPlus->mf_set_data_us( "amount",   "0"       );
    $common_data_set .= $c_PayPlus->mf_set_data_us( "cust_ip",  $cust_ip  );
    $common_data_set .= $c_PayPlus->mf_set_data_us( "escw_mod", "N"       );
    $c_PayPlus->mf_add_payx_data( "common", $common_data_set );
    // 주문 정보
    $ordr_data_set;
    $c_PayPlus->mf_set_ordr_data( "ordr_idxx",  $ordr_idxx   );
    // 계좌 정보
    $acnt_data_set;
    $acnt_data_set .= $c_PayPlus->mf_set_data_us( "bk_owner_nm", $owner_nm);  // 예금주명
    if ( $pay_method == "ACCO" )
    {
        $acnt_data_set .= $c_PayPlus->mf_set_data_us( "bk_txtype",     "74200000"       );  // 지불 타입 (계좌 인증)
        $acnt_data_set .= $c_PayPlus->mf_set_data_us( "bk_code",       $bank_code       );  // 은행 코드
        $acnt_data_set .= $c_PayPlus->mf_set_data_us( "bk_account_no", $account_no      );  // 발급 계좌
    }
    $c_PayPlus->mf_add_payx_data( "bank", $acnt_data_set );
}
/* = -------------------------------------------------------------------------- = */
/* =   03. 인증 요청 정보 설정 END                                          = */
/* ============================================================================== */
/* ============================================================================== */
/* =   04. 실행                                                                 = */
/* = -------------------------------------------------------------------------- = */
if ( strlen( $tran_cd ) > 0 )
{
    $c_PayPlus->mf_do_tx( "", $g_conf_home_dir, $g_conf_site_cd, $g_conf_site_key, $tran_cd, "", $g_conf_gw_url, $g_conf_gw_port, "payplus_cli_slib",	"",	$cust_ip, "3", "", "0", $g_conf_key_dir, $g_conf_log_dir );
}
else
{
    $c_PayPlus->m_res_cd  = "9562";
    $c_PayPlus->m_res_msg = "연동 오류|tran_cd값이 비어 있습니다.";
}
$res_cd  = $c_PayPlus->m_res_cd;                      // 결과 코드
$res_msg = $c_PayPlus->m_res_msg;                     // 결과 메시지
/* = -------------------------------------------------------------------------- = */
/* =   04. 실행 END                                                             = */
/* ============================================================================== */
/* ================================================================================= */
/* =   05.인증 결과 처리														= */
/* = -------------------------------------------------------------------------- = */
if ( $req_tx = "pay" )
{
    if ( $res_cd == "0000" )
    {
        $tno       = $c_PayPlus->mf_get_res_data( "tno"       );    // KCP 거래 고유 번호
        $app_time  = $c_PayPlus->mf_get_res_data( "app_time"  );
    } // End of [res_cd = "0000"]
    /* = -------------------------------------------------------------------------- = */
    /* =   05.인증 실패 결과 처리													= */
    /* = -------------------------------------------------------------------------- = */
    else
    {
    }
} // End of Proces
/* ============================================================================== */
/* =   06. 폼 구성 및 결과페이지 호출                                           = */
/* = -------------------------------------------------------------------------- = */

$msg = "계좌가 정상적으로 확인되었습니다.";
$success = true;
if($res_cd!="0000") {
    $msg = "입력한 계좌정보를 확인해 주시기 바랍니다.\n(".$res_cd.")".iconv("EUC-KR","UTF-8",$res_msg);
    $success = false;
}else{
}
return_json($success,$msg);
?>